Documents/ПередачаНаКомиссию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПередачаНаКомиссию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаКомиссии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупкиСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКомитента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Долги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДолгПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Чем</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПередачаНаКомиссию/Ext/ManagerModule.bsl
// © Primus1C  06.10.2025  НАЧАЛО ►

#Область Печать
	
Процедура ВывестиСекцию(Таб, Макет, Область, Параметры, Уровень=Неопределено) 

	Обл = Макет.ПолучитьОбласть(Область); 
	Обл.Параметры.Заполнить(Параметры);  
	Если Уровень = Неопределено Тогда
		Таб.Вывести(Обл);
	Иначе
		Таб.Вывести(Обл, Уровень);
	КонецЕсли;     
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СПФ = Новый Структура("БезСерий, ПоСериям 
							//|,БезСерийПоАлфавиту, ПоСериямПоАлфавиту
							|",  
							НСтр("ru='Передача на комиссию (без серий)';en='Передача на комиссию (no series)'"), 
							НСтр("ru='Передача на комиссию (по сериям)';en='Передача на комиссию (with series)'"),		
							//НСтр("ru='Передача на комиссию (без серий), алфавитный порядок';en='Передача на комиссиюe (no series), alphabetical order'"), 
							//НСтр("ru='Передача на комиссию (по сериям), алфавитный порядок';en='Передача на комиссию (with series), alphabetical order'")		
							);		
	Возврат СПФ;						
							
КонецФункции 

Процедура ПечатьДокумента(ДокСсылка, ВариантПечатнойФормы, ТабДокумент, Параметры = Неопределено) Экспорт
	
	ТабДокумент.Очистить();  
	//Макет = Документы.РасходнаяНакладная.ПолучитьМакет(ВариантПечатнойФормы);
	Макет = Документы.ПередачаНаКомиссию.ПолучитьМакет("Печать");
	
	ЗапрШ = Новый Запрос;
	ЗапрШ.УстановитьПараметр("Ссылка", ДокСсылка);
	ЗапрШ.УстановитьПараметр("ПредставлениеДокумента",  ОбщегоНазначения.ПредставлениеДокументаДляПечати(ДокСсылка, ));
	ЗапрШ.Текст = "ВЫБРАТЬ
	              |	Накладная.Номер КАК Номер,
	              |	Накладная.Дата КАК Дата,
	              |	Накладная.Фирма КАК Поставщик,
	              |	Накладная.Контрагент КАК Покупатель,
	              |	Накладная.Сумма КАК Сумма,
	              |	Накладная.Валюта КАК Валюта,
	              |	Накладная.Склад.Наименование КАК ИмяСклада,
	              |	Накладная.Количество КАК Количество,
	              |	ВЫРАЗИТЬ(Накладная.Примечание КАК СТРОКА(1000)) КАК Примечание,
	              |	&ПредставлениеДокумента КАК ПредставлениеДокумента
	              |ИЗ
	              |	Документ.ПередачаНаКомиссию КАК Накладная
	              |ГДЕ
	              |	Накладная.Ссылка = &Ссылка";   
	ОбщегоНазначенияСервер.УстановитьПредставлениеКонтрагентаВЗапросе(ЗапрШ.Текст, "Накладная.Контрагент");	
	Шапка = ЗапрШ.Выполнить().Выбрать();
	Шапка.Следующий(); 
	ВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка); 

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", ДокСсылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЧТовары.Номенклатура КАК Номенклатура,
	             |	ТЧТовары.Серия КАК Серия,
	             |	ТЧТовары.ЦенаЗакупки КАК ЦенаЗакупки,
	             |	ТЧТовары.Количество КАК Количество,
	             |	ТЧТовары.ЦенаКомитента КАК Цена,
	             |	ТЧТовары.Партия КАК Партия,
	             |	ТЧТовары.НомерСтроки КАК НомерСтроки,
	             |	ТЧТовары.Ссылка.Валюта КАК Валюта,
	             |	ТЧТовары.Сумма КАК Сумма
	             |ИЗ
	             |	Документ.ПередачаНаКомиссию.Товары КАК ТЧТовары
	             |ГДЕ
	             |	ТЧТовары.Ссылка = &Ссылка";
	//Если ПоАлфавиту Тогда
	//	Запр.Текст = Запр.Текст + " УПОРЯДОЧИТЬ ПО РНТовары.Номенклатура.Наименование";	
	//КонецЕсли;

	ИтКоличество = 0;
	ИтСумма = 0;
	//Ном = 0;
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл     
		ИтКоличество = ИтКоличество + Выборка.Количество; 
		ИтСумма = ИтСумма + Выборка.Сумма;
		//Ном = Ном + 1;
		//ОбластьДно.Параметры.Ном = Ном;
		ВывестиСекцию(ТабДокумент, Макет, "Строка", Выборка);  
		Если ВариантПечатнойФормы = "ПоСериям" Тогда
			ВывестиСекцию(ТабДокумент, Макет, "Серия", Выборка);  
		КонецЕсли;
	КонецЦикла;
	
	ОбластьДно = Макет.ПолучитьОбласть("Дно");
	ОбластьДно.Параметры.Заполнить(Шапка);
	ОбластьДно.Параметры.ИтКоличество = ИтКоличество;
	ОбластьДно.Параметры.ИтСумма = ИтСумма;
	ОбластьДно.Параметры.СуммаПрописью = гоСуммаПрописьюВал(ИтСумма, Шапка.Валюта); 

	//+
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДолгиОстатки.Валюта,
	               |	ДолгиОстатки.ПокупательОстаток
	               |ИЗ
	               |	РегистрНакопления.Долги.Остатки(
	               |			,
	               |			Контрагент = &Контрагент
	               |				И Фирма = &Фирма) КАК ДолгиОстатки";
	Запрос.УстановитьПараметр("Контрагент", Шапка.Покупатель);
	Запрос.УстановитьПараметр("Фирма", Шапка.Поставщик);
	Выборка = ЗАпрос.Выполнить().Выбрать();
	СтрокаЗадолженность = "Задолженность : ";
	Пока Выборка.Следующий() Цикл
		 СтрокаЗадолженность = СтрокаЗадолженность+ " 
		 | "+ Выборка.ПокупательОстаток + " " + Выборка.Валюта+ ";";	
	 КонецЦикла;
	 ОбластьДно.Параметры.Задолженность = СтрокаЗадолженность;
	 //-
	
	ТабДокумент.Вывести(ОбластьДно);

КонецПроцедуры

#КонецОбласти
